[
{"title":"Folder index page",
"summary":"A page that lists all contents (i.e. files) of the folder in which the page resides, with links to each file plus other filetype-specific behavior (thumbnails for image files etc.)",
"details":"The bulk of the code is contained by this file (not executable directly, by design):<p style='text-align:right'><mark>showFolderContents.php <a href=\"projects/showFolderContents/showFolderContents_viewSource.php\">(view source)</a></mark><br>(Running the PHP file itself - click <a href=\"projects/showFolderContents/showFolderContents.php\">here</a> if you want to try - is not allowed for standard backend security reasons)<p>In every folder for which this functionality is wanted, a simple wrapper file with a few lines of code (see header comment of the \"bulk file\" above) shall be added:<p style=\"text-align:right\">index.php <a href=\"http://tuejoshua.atwebpages.com/showFolderContents/index_viewSource.php\">(view source)</a><p>- by naming this file index.php, the page will (depending on your server setup*) be displayed when the URL for the containing folder is requested - which is exactly what we want. <p>Lastly, <a href=\"projects/hilchotBrachot/resources/foods/\">here</a>'s a working example (a folder with some actual contents, showcasing the capabilities of my folder index page.<p>*) <a href=\"https://www.lifewire.com/index-html-page-3466505\">Here</a>'s a nice article about the \"index.html/.php\" naming convention (I take no responsibility for dead links etc. ;-)).",
"motivation":"I wanted to share direct links to images* on my server. However, since my webhost does not allow direct access to image files, I needed an \"in-between\" page for handling that traffic. As I also wanted links to be as short as possible, I came up with this solution, where I can simply put relevant resource(s) in a folder, include a simple \"index.php\" wrapper file, and then share the link to the folder instead.<p>*) Originally, the output image for <a href=\"#Zmanim_for_Machsike_Hadas,_Copenhagen\">the Zmanim_for_Machsike_Hadas project</a>; where the link actually got a LOT shorter (due to a long file name).",
"isPython":false,
"isPhp":true,
"isFrontEnd":true
},
{"title":"Zmanim for Machsike Hadas, Copenhagen",
"summary":"...<p><a href=\"projects/zmanim/zmanim_machsikeHadasCopenhagen.png\"><img src=\"projects/zmanim/zmanim_machsikeHadasCopenhagen.png\" height=100></a>",
"details":"<a href=\"https://gist.github.com/tuejoshua/a450b4492218327cb46c471e9191adfd\">Here</a> is a GitHub Gist with my Python code.",
"motivation":"...",
"isPython":true,
"isPhp":false,
"isFrontEnd":false
},
{
"title":"Hilchot Brachot games",
"summary":"A suite of games for practicing the principles of Hilchot Brachot* (hebrew: \"Laws of Blessings\"); in particular, Birkat HaNehinin (Blessings before and after all types of food).<p>The main page is <a href=\"projects/hilchotBrachot\">here</a>.<p>*) as stated inside the games as well: please do not decide halachic questions based on these games; they are meant only as an AID, not as a SOURCE of learning - for the latter, <a href=\"https://www.acronymattic.com/Ask-Your-Local-Orthodox-Rabbi-(AYLOR).html\">AYLOR</a>",
"details":"They were (and are still) developed based on the following principles:<br>Use multimedia but keep lightweight<br>frontend-techniques only",
"motivation":"Besides the goal to aid learning the subject matter for kids and adults alike, also: how much of a \"real\" game experience can be created using only these languages? ... <p>",
"isPython":false,
"isPhp":false,
"isFrontEnd":true
},
{
"title":"PHP image gallery",
"summary":"...",
"details":"...",
"motivation":"...",
"isPython":false,
"isPhp":true,
"isFrontEnd":true
},
{
"title":"Tarps kabale",
"summary":"<a href=\"projects/tarpsKabale/TarpsKabale.html\">Tarps kabale</a>",
"details":"...",
"motivation":"...",
"isPython":false,
"isPhp":false,
"isFrontEnd":true
}
]
